var positions = ["Реализатор", "Координатор", "Мотиватор", "Генератор идеи", "Исследователь", "Эксперт", "Дипломат", "Контролер"];
var descriptions = ["Реализаторам присущи практический здравый смысл и хорошее чувство самоконтроля и дисциплины. Они любят тяжелую работу и преодоление проблем в системном режиме. В большей степени Реализаторы являются типичными личностями, чья верность и интерес совпадают с ценностями Компании. Они менее сконцентрированы на преследовании собственных интересов. Тем не менее, им может не хватать спонтанности, и они могут проявлять жесткость и непреклонность.Они очень полезны компании благодаря своей надежности и прилежанию. Они добиваются успеха, потому что очень работоспособны и могут четко определить то, что выполнимо и имеет отношение к делу. Говорят, что многие исполнители делают ту работу, которую хотят делать и пренебрегают заданиями, которые находят неприятными. Реализаторы часто продвигаются до высоких должностных позиций в управлении благодаря своим хорошим организаторским способностями и компетентности в решении всех важных вопросов.", "Отличительной чертой координаторов является способность заставлять других работать над распределенными целями. Зрелый, опытный, уверенный, Координатор охотно раздает поручения. В межличностных отношениях они быстро раскрывают индивидуальные наклонности и таланты и мудро их используют для достижения целей команды. Они не обязательно самые умные члены команды, это люди с большим кругозором и опытом, пользующиеся общим уважением команды.Они хорошо себя проявляют, находясь во главе команды людей с различными навыками и характерами. Они лучше работают совместно с коллегами равными по рангу или позиции, чем с сотрудниками более низких уровней. Их девизом может быть «консультация с контролем». Они верят, что проблему можно решить мирным путем. В некоторых компаниях Координаторы могут вступать в конфликты из-за разности во взглядах с Творцами.", "Это люди с высоким уровнем мотивации, неисчерпаемой энергией и великой жаждой достижений. Обычно это ярко выраженные экстраверты, обладающие сильной напористостью. Им нравится вести других и подталкивать к действиям. Если возникают препятствия, они быстро находят обходные пути. Своевольные и упрямые, уверенные и напористые, они имеют склонность эмоционально отвечать на любую форму разочарования или крушения планов. Целеустремленные, любящие поспорить. Но им часто не хватает простого человеческого понимания. Их роль самая конкурентная в команде.Они обычно становятся хорошими руководителями, благодаря тому, что умеют генерировать действия и успешно работать под давлением. Они умеют легко воодушевлять команду, и очень полезны в группах с разными взглядами, так как способны укротить страсти. Творцы способны парить над проблемами такого рода, продолжая лидировать, не считаясь с ними. Они могут легко провести необходимее изменения и не отказываются от нестандартных решений. Отвечая названию, они пытаются навязывать группе некоторые образцы или формы поведения и деятельности. Они являются самыми эффективными членами команды, способными гарантировать позитивные действия.", "Генераторы идей являются инноваторами и изобретателями, могут быть очень креативными. Они сеют зерно и идеи, из которых прорастают большинство разработок и проектов. Обычно они предпочитают работать самостоятельно, отделившись от других членов команды, используя свое воображение и часто следуя нетрадиционным путем. Имеют склонность быть интровертами, сильно реагируют как на критику, так и на похвалу. Часто из идеи имеют радикальный характер, и им не хватает практических усилий. Они независимы, умны и оригинальны, но могут быть слабыми в общении с людьми другого уровня или направления.Основная функция Генераторов идей – создание новых предложений и решение сложных комплексных проблем. Они очень необходимы на начальных стадиях проектов или когда проект находится под угрозой срыва. Они обычно являются основателями компаний или организаторами новых производств. Тем не менее, большое количество Генераторов идей в одной компании может привести к контрпродуктивности, так как они имеют тенденцию проводить время, укрепляя собственные идеи и вступая друг с другом в конфликт.", "Это очень серьезные и предусмотрительные люди с врожденным иммунитетом против чрезмерного энтузиазма. Медлительны в принятии решения, предпочитают хорошо все обдумать. Они способны критически мыслить. Они умеют быть проницательными в суждениях, принимая во внимание все факторы. Эксперты редко ошибаются.Эксперты наиболее подходят для анализа проблем и оценки идей и предложений. Они хорошо умеют взвешивать все «за» и «против» предложенных вариантов. По сравнению с другими, Эксперты кажутся черствыми, занудными и чрезмерно критичными. Некоторые удивляются, как им удается стать руководителями. Тем не менее, многие эксперты занимают стратегические посты и преуспевают на должностях высшего ранга. Очень редко удача или срыв дела зависит от принятия спешных решений. Эта идеальная «сфера» для Экспертов, людей, которые редко ошибаются, и, в конце концов, выигрывают.", "Исследователи – часто энтузиасты и яркие экстраверты. Они умеют общаться с людьми в компании и за ее пределами. Они рождены для ведения переговоров, исследования новых возможностей и налаживания контактов. Хотя и не являясь генераторами гениальных идей, они очень легко подхватывают идеи других и развивают их. Они очень легко распознают, что есть в наличии и что еще можно сделать. Их обычно очень тепло принимают в команде благодаря их открытой натуре. Они всегда открыты и любознательны, готовы найти возможности во всем новом. Но, если они не стимулируются другими, их энтузиазм быстро снижается.Они очень хорошо реагируют и отвечают на новые идеи и разработки, могут найти ресурсы и вне группы. Они самые подходящие люди для установки внешних контактов и проведения последующих переговоров. Они умеют самостоятельно думать, получая информацию от других.", "Это люди, пользующиеся наибольшей поддержкой команды. Они очень вежливы, обходительны и общительны. Они умеют быть гибкими и адаптироваться к любой ситуации и разным людям. Дипломаты очень дипломатичны и восприимчивы. Они умеют слушать других и сопереживать, очень популярны в команде. В работе они полагаются на чувствительность, но могут столкнуться с трудностью при принятии решений в срочных и неотложных ситуациях.Роль Дипломатов состоит в предотвращении межличностных проблем, появляющихся в команде, и, поэтому это позволяет эффективно работать всем ее членам. Избегая трений, они будут идти длинной дорогой, ради того, чтобы обойти их стороной. Они не часто становятся руководителями, тем более, если их непосредственный начальник подчиняется Творцу. Это создает климат, в котором дипломатия и восприимчивость людей этого типа является настоящей находкой для команды, особенно при управленческом стиле, где конфликты могут возникать и должны искусственно пресекаться. Такие люди в качестве руководителя не представляют угрозу ни для кого и поэтому всегда желанны для подчиненных. Дипломаты служат своего рода «смазкой» для команды, а люди в такой обстановке сотрудничают лучше.", "Обладают огромной способностью доводить дело до завершения и обращать внимание на детали. Они никогда не начинают то, что не могут довести до конца. Они мотивируются внутренним беспокойством, хотя часто внешне выглядят спокойными и невозмутимыми. Представители этого типа часто являются интровертами. Им обычно не требуется стимулирование извне, или побуждения. Они не терпят случайностей. Не склонны к делегированию, предпочитают выполнять задания самостоятельно.Являются незаменимыми в ситуациях, когда задания требуют сильной концентрированности и высокого уровня аккуратности. Они несут чувство срочности и неотложности в команду и хорошо проводят различные митинги. Хорошо справляются с управлением, благодаря своему стремлению к высшим стандартам, своей аккуратности, точности, вниманию к деталям и умению завершать начатое дело."];
var max = 0,
    amax = 0;

function gr(tmp) {
    if (tmp === "" || tmp === " ") {
        alert("Empty input");
        return;
    }
    for (var i = 0; i < tmp.length; ++i) {
        if (tmp[i] === "," || tmp[i] === "@" || tmp === "!" || tmp[i] === "$" || tmp[i] === "%" || tmp[i] === "?" || tmp[i] === "#" || tmp[i] === ";" || tmp[i] === "(" || tmp[i] === ")" || tmp[i] === "[" || tmp[i] === "]" || tmp[i] === "{" || tmp[i] === "}" || tmp[i] === "<" || tmp[i] === ">" || tmp[i] === "^" || tmp[i] === "*" || tmp[i] === "/" || tmp[i] === "|" || tmp[i] === '№' || tmp[i] === ".") {
            alert("Signs like '.', '.', '!', '?', '@', '$', '()', '[]', etc. are not allowed in usernames.");
            return;
        }
    }
    var d = new Date();
    d.setTime(d.getTime() + (29 * 24 * 60 * 60 * 1000));
    var expires = "expires=" + d.toUTCString();
    document.cookie = "user=" + tmp + ";" + expires;
    window.open("groups.php", "_self");
}

function back(grp) {
    window.open("gr.php?" + grp, "_self");
}

function group_1(a) {
    var d = new Date();
    d.setTime(d.getTime() + (29 * 24 * 60 * 60 * 1000));
    var expires = "expires=" + d.toUTCString();
    var temp = document.getElementById('item' + a).innerHTML;
    document.cookie = "group=" + temp + ";" + expires;
    tempo = temp.split(" ");
    temp = tempo.join("_");
    window.open("gr.php?" + temp, "_self");

}

function fill() {
    var temp = document.cookie;
    var arr = temp.split(";");
    var pos = ["user", "group", "result"];
    for (var i = 0; i < arr.length; ++i) {
        var arr1 = arr[i].split("=");
        for (var j = 0; j < pos.length; ++j) {
            if (arr1[0] === " " + pos[j] || arr1[0] === pos[j]) document.getElementById(pos[j]).value = arr1[1];
        }
    }
}

function group_graph(array_one) {
    var cnt = [0, 0, 0, 0, 0, 0, 0, 0];
    for (var i = 0; i < array_one.length; ++i) {
        var temp = array_one[i].split("_").join(" ");
        for (var j = 0; j < positions.length; ++j) {
            if (positions[j] === temp) cnt[j]++;
        }
    }

    let ctx = document.getElementById("myChart").getContext('2d');
    let colorHex = ["#ff3300", "#80aaff", "#ffd480", "#d9b3ff", "#ffaa80", "#70db70", "#8080ff", "#bf80ff"];
    let myChart = new Chart(ctx, {
        type: 'pie',
        data: {
            datasets: [{
                data: cnt,
                backgroundColor: colorHex
        }],
            labels: positions
        },
        options: {
            responsive: true,
            legend: {
                position: 'bottom'
            },
            plugins: {
                datalabels: {
                    color: '#fff',
                    anchor: 'end',
                    align: 'start',
                    offset: -10,
                    borderWidth: 2,
                    borderColor: '#fff',
                    borderRadius: 25,
                    backgroundColor: (context) => {
                        return context.dataset.backgroundColor;
                    },
                    font: {
                        weight: 'bold',
                        size: '10'
                    },
                    formatter: (value) => {
                        return (value / array_one.length) * 100 + '%';
                    }
                }
            }
        }
    });

    canvas = document.getElementById("myChart");

    canvas.onclick = function (evt) {
        var activePoints = myChart.getElementsAtEvent(evt);
        if (activePoints[0]) {
            var chartData = activePoints[0]['_chart'].config.data;
            var idx = activePoints[0]['_index'];
            var label = chartData.labels[idx];
            var desc = "";
            for (var i = 0; i < positions.length; ++i) {
                if (positions[i] === label) {
                    desc = descriptions[i];
                    break;
                }
            }
            document.getElementById("title_m").innerHTML = label;
            document.getElementById("desc_m").innerHTML = desc;
            $(document).ready(function () {
                $("#chars").modal({
                    backdrop: false
                });
            });

        }
    }


}

share = {
    vk: function (url) {
        url = "http://vk.com/share.php?url=" + encodeURIComponent("http://localhost/Project/gr.php?" + url);
        window.open(url, "", "toolbar=0,status=0,width:720,height:500");
    },
    tw: function (url) {
        url = "https://twitter.com/intent/tweet?text=" + encodeURIComponent("http://localhost/Project/gr.php?" + url);
        window.open(url, "", "toolbar=0,status=0,width:720,height:500");
    }
}

function calculate() {
    var results = [0, 0, 0, 0, 0, 0, 0, 0];
    var i = 10,
        rezz = 0,
        rezztmp = 0;
    while (i <= 77) {
        if (i % 10 === 8) {
            if (rezztmp != 10) {
                results = [0, 0, 0, 0, 0, 0, 0, 0];
                alert("invalid data. try again");
                var j = i - 10;
                var rnd = Math.round(j / 10);
                document.getElementById("part" + rnd).scrollIntoView();
                rezztmp = 0;
                break;
            }
            i += 2;
            rezztmp = 0;


        }

        var tmp;
        if (i === 16 || i === 20 || i === 37 || i === 43 || i === 51 || i === 65 || i === 74) tmp = 0;
        else if (i === 13 || i === 21 || i === 30 || i === 47 || i === 55 || i === 62 || i === 76) tmp = 1;
        else if (i === 15 || i === 24 || i === 32 || i === 41 || i === 53 || i === 66 || i === 70) tmp = 2;
        else if (i === 12 || i === 26 || i === 33 || i === 44 || i === 57 || i === 60 || i === 75) tmp = 3;
        else if (i === 10 || i === 22 || i === 35 || i === 46 || i === 54 || i === 67 || i === 73) tmp = 4;
        else if (i === 17 || i === 23 || i === 36 || i === 42 || i === 50 || i === 64 || i === 71) tmp = 5;
        else if (i === 11 || i === 25 || i === 34 || i === 40 || i === 52 || i === 61 || i === 77) tmp = 6;
        else if (i === 14 || i === 27 || i === 31 || i === 45 || i === 56 || i === 63 || i === 72) tmp = 7;
        results[tmp] += parseInt(document.getElementById("t" + i).value);
        rezz += parseInt(document.getElementById("t" + i).value);
        rezztmp += parseInt(document.getElementById("t" + i).value);
        ++i;
    }
    if (i === 78) {
        var tm = JSON.stringify(results);
        window.open("results.php?" + tm, "_self");

    }
}

function results() {
    var rezz = (document.getElementById("ph").innerHTML).split("[")[1].split("]")[0].split(",");
    max = 0, amax = 0;
    for (var j = 0; j < rezz.length; ++j) {
        if (max < parseInt(rezz[j])) {
            max = parseInt(rezz[j]);
            amax = j;
        }
    }
    document.getElementById("work_type").innerHTML = positions[amax];
    document.getElementById("explain").innerHTML = descriptions[amax];
    var d = new Date();
    d.setTime(d.getTime() + (24 * 60 * 60 * 1000));
    var expires = "expires=" + d.toUTCString();
    document.cookie = "result=" + positions[amax] + ";" + expires;

    let ctx = document.getElementById("myChart").getContext('2d');
    let colorHex = ["#ff3300", "#80aaff", "#ffd480", "#d9b3ff", "#ffaa80", "#70db70", "#8080ff", "#bf80ff"];
    let myChart = new Chart(ctx, {
        type: 'pie',
        data: {
            datasets: [{
                data: rezz,
                backgroundColor: colorHex
        }],
            labels: positions
        },
        options: {
            responsive: true,
            legend: {
                position: 'bottom'
            },
            plugins: {
                datalabels: {
                    color: '#fff',
                    anchor: 'end',
                    align: 'start',
                    offset: -10,
                    borderWidth: 2,
                    borderColor: '#fff',
                    borderRadius: 25,
                    backgroundColor: (context) => {
                        return context.dataset.backgroundColor;
                    },
                    font: {
                        weight: 'bold',
                        size: '10'
                    },
                    formatter: (value) => {
                        return value;
                    }
                }
            }
        }
    });
    
    canvas = document.getElementById("myChart");

    canvas.onclick = function (evt) {
        var activePoints = myChart.getElementsAtEvent(evt);
        if (activePoints[0]) {
            var chartData = activePoints[0]['_chart'].config.data;
            var idx = activePoints[0]['_index'];
            var label = chartData.labels[idx];
            var desc = "";
            for (var i = 0; i < positions.length; ++i) {
                if (positions[i] === label) {
                    desc = descriptions[i];
                    break;
                }
            }
            document.getElementById("title_m").innerHTML = label;
            document.getElementById("desc_m").innerHTML = desc;
            $(document).ready(function () {
                $("#chars").modal({
                    backdrop: false
                });
            });

        }
    }

}
